//Задача 1. Задайте значение N. Напишите программу, которая выведет все натуральные числа в промежутке от 1 до N.

//N = 5 -> "1, 2, 3, 4, 5"
//N = 6 -> "1, 2, 3, 4, 5, 6"

// void ShowNum(int n)
// {
//     if (n > 0)
//     {
//         ShowNum(n - 1);
//         System.Console.Write(n + " ");
//     }
// }

// ShowNum(5);

// ___________________________________________________________________________________________________

//Задание 2. Напишите программу, которая будет принимать на вход число и возвращать сумму его цифр.

//453 -> 12
//45 -> 9

// int FindSum(int num)
// {
//     if (num > 0)
//     {
//         return FindSum(num / 10) + num % 10;
//     }
//     else return num;
// }

// System.Console.WriteLine(FindSum(453));

// _______________________________________________________________________________________________

//Задача 3. Задайте значения M и N. Напишите программу, которая выведет все натуральные числа в промежутке от M до N.

//M = 1; N = 5. -> "1, 2, 3, 4, 5"
//M = 4; N = 8. -> "4, 5, 6, 7, 8"

// void NumsFromTo(int m, int n)
// {
//     if (m != n)
//     {
//         if (m > n)
//         {
//             NumsFromTo(m - 1, n);
//             System.Console.Write(m + " ");
//         }
//         else
//         {
//             NumsFromTo(m, n - 1);
//             System.Console.Write(n + " ");
//         }
//     }
//     else System.Console.Write(n + " ");
// }

// NumsFromTo(10, 5);


// _________________________________________________________________________________________________________

//Задача 4.Напишите программу, которая на вход принимает два числа A и B, и возводит число А в целую степень B с помощью рекурсии.

//A = 3; B = 5 -> 243 (3⁵)
//A = 2; B = 3 -> 8

int Exp(int a, int b)
{
    if (b >= 1)
    {
        return Exp(a, b - 1) * a;
    }
    else return 1;
}
System.Console.Write(Exp(3, 5));